export const stations = [
  {
    name: "崇文门",
    latitude: 29.535833333333333 - 0.003,
    longitude: 106.60055555555556 + 0.0042,
    owner: "所属：一号线 二号线 三号线 四号线",
    nearby: "周边：..."
  },
  // {
  //   name: "宁静苑",
  //   latitude: 29.531944444444445 - 0.0028,
  //   longitude: 106.60305555555556 + 0.0039,
  //   owner: "所属：一号线",
  //   nearby: "周边：..."
  // },
  {
    name: "综合实验楼",
    latitude: 29.529166666666665 - 0.003,
    longitude: 106.60194444444444 + 0.0038,
    owner: "所属：二号线 三号线",
    nearby: "周边：..."
  },
  {
    name: "明理八",
    latitude: 29.532777777777778 - 0.0035,
    longitude: 106.605 + 0.0033,
    owner: "所属：一号线",
    nearby: "周边：..."
  },
  {
    name: "千喜鹤",
    latitude: 29.532777777777778 - 0.0027,
    longitude: 106.605 + 0.0039,
    owner: "所属：一号线",
    nearby: "周边：..."
  },
  {
    name: "明理1",
    latitude: 29.53388888888889 - 0.00285,
    longitude: 106.60555555555555 + 0.0039,
    owner: "所属：一号线 二号线",
    nearby: "周边：..."
  },
  // {
  //   name: "兴业苑",
  //   latitude: 29.535555555555554 - 0.00285,
  //   longitude: 106.60777777777778 + 0.00365,
  //   owner: "所属：一号线",
  //   nearby: "周边：..."
  // },
  {
    name: "八教",
    latitude: 29.537777777777777 - 0.00285,
    longitude: 106.60694444444445 + 0.00385,
    owner: "所属：一号线",
    nearby: "周边：..."
  },
  // {
  //   name: "四／五教",
  //   latitude: 29.538611111111113 - 0.00275,
  //   longitude: 106.60638888888889 + 0.0037,
  //   owner: "所属：一号线",
  //   nearby: "周边：..."
  // },
  {
    name: "三教",
    latitude: 29.538055555555555 - 0.00275,
    longitude: 106.60444444444444 + 0.0037,
    owner: "所属：一号线",
    nearby: "周边：..."
  },
  {
    name: "腾飞门",
    latitude: 29.538055555555555 - 0.00275,
    longitude: 106.60166666666667 + 0.0038,
    owner: "所属：一号线 二号线 三号线 四号线",
    nearby: "周边：..."
  },
  {
    name: "二教",
    latitude: 29.535555555555554 - 0.0032,
    longitude: 106.60166666666667 + 0.0053,
    owner: "所属：一号线",
    nearby: "周边：..."
  },
  {
    name: "大西北食堂",
    latitude: 29.53361111111111 - 0.0028,
    longitude: 106.60388888888889 + 0.0039,
    owner: "所属：二号线",
    nearby: "周边：..."
  },
  {
    name: "逸夫楼",
    latitude: 29.538055555555555 - 0.002,
    longitude: 106.60444444444444 + 0.0037,
    owner: "所属：一号线 二号线 三号线",
    nearby: "周边：..."
  },
  {
    name: "留学生楼",
    latitude: 29.538055555555555 - 0.0036,
    longitude: 106.60444444444444 + 0.0054,
    owner: "所属：一号线",
    nearby: "周边：..."
  },
  {
    name: "经管学院",
    latitude: 29.538055555555555 - 0.00372,
    longitude: 106.60444444444444 + 0.00629,
    owner: "所属：一号线 二号线",
    nearby: "周边：..."
  },
  {
    name: "兴业苑6舍", //16
    latitude: 29.535555555555554 - 0.00285,
    longitude: 106.60777777777778 + 0.00365,
    owner: "所属：一号线 二号线",
    nearby: "周边：..."
  },
  {
    name: "物业管理中心", //17
    latitude: 29.53361111111111 - 0.0028,
    longitude: 106.60388888888889 + 0.0039,
    owner: "所属：一号线 二号线",
    nearby: "周边：..."
  },
  {
    name: "南部校区十字路口", //18
    latitude: 29.529166666666665 - 0.0024,
    longitude: 106.60194444444444 + 0.00505,
    owner: "所属：二号线 三号线",
    nearby: "周边：..."
  },
  {
    name: "宁静苑8舍",
    latitude: 29.531944444444445 - 0.0034,
    longitude: 106.60305555555556 + 0.0039,
    owner: "所属：二号线",
    nearby: "周边：..."
  },
  {
    name: "樱花食堂",
    latitude: 29.532777777777778 - 0.00258,
    longitude: 106.605 + 0.00322,
    owner: "所属：二号线",
    nearby: "周边：..."
  },
  {
    name: "荷花池",
    latitude: 29.535555555555554 - 0.0051,
    longitude: 106.60166666666667 + 0.0048,
    owner: "所属：二号线 三号线 四号线",
    nearby: "周边：..."
  },
  {
    name: "重邮信科楼",
    latitude: 29.535555555555554 - 0.0044,
    longitude: 106.60166666666667 + 0.00256,
    owner: "所属：二号线 三号线 四号线",
    nearby: "周边：..."
  },
  {
    name: "北校门路口",
    latitude: 29.538055555555555 - 0.0015,
    longitude: 106.60444444444444 + 0.0037,
    owner: "所属：二号线",
    nearby: "周边：..."
  },
  {
    name: "国际学院",
    latitude: 29.538611111111113 - 0.00275,
    longitude: 106.60638888888889 + 0.0037,
    owner: "所属：二号线",
    nearby: "周边：..."
  },
  {
    name: "后勤处",
    latitude: 29.531944444444445 - 0.00313,
    longitude: 106.60305555555556 + 0.0035,
    owner: "所属：三号线 四号线",
    nearby: "周边：..."
  },
  {
    name: "南部校区80栋",
    latitude: 29.529166666666665 - 0.0053,
    longitude: 106.60194444444444 + 0.0057,
    owner: "所属：四号线",
    nearby: "周边：..."
  }
];

export const roads = {
  one: {
    bus: "1",
    stations: [
      "崇文门",
      "腾飞门",
      "逸夫楼",
      "北校门路口",
      "国际学院",
      "经管学院",
      "兴业苑6舍",
      "明理苑1舍",
      "千喜鹤"
    ]
  },
  two: {
    bus: "2",
    stations: [
      "综合实验楼",
      "南部校区十字路口",
      "宁静苑8舍",
      "荷花池",
      "重邮信科楼",
      "崇文门",
      "腾飞门",
      "逸夫楼",
      "北校门路口",
      "国际学院",
      "经管学院",
      "兴业苑6舍",
      "明理苑1舍路口",
      "千喜鹤",
      "樱花食堂",
      "大西北食堂"
    ]
  },
  three: {
    bus: "3",
    stations: [
      "八教",
      "四教/五教",
      "逸夫楼",
      "三教",
      "二教",
      "宁静苑8舍",
      "南部校区十字路口",
      "综合实验楼"
    ]
  },
  four: {
    bus: "4",
    stations: [
      "南部校区80栋",
      "后勤处路口",
      "荷花池",
      "重邮信科楼",
      "崇文门",
      "腾飞门"
    ]
  }
};
