export const stations = [
  {
    name: "崇文门",
    latitude: 29.535833333333333 - 0.003,
    longitude: 106.60055555555556 + 0.0042,
    owner: "所属：一号线 二号线 三号线 四号线",
    nearby: "周边：科技会堂 校医院"
  },
  // {
  //   name: "宁静苑",
  //   latitude: 29.531944444444445 - 0.0028,
  //   longitude: 106.60305555555556 + 0.0039,
  //   owner: "所属：一号线",
  //   nearby: "周边：..."
  // },
  {
    name: "综合实验楼",
    latitude: 29.529166666666665 - 0.003,
    longitude: 106.60194444444444 + 0.0038,
    owner: "所属：二号线 三号线",
    nearby: "周边：综合实验楼 生物信息学院 学术报告厅"
  },
  {
    name: "明理八",
    latitude: 29.532777777777778 - 0.0035,
    longitude: 106.605 + 0.0033,
    owner: "所属：一号线",
    nearby: "周边：明理苑8舍 宁静苑6舍 学深惠生活超市"
  },
  {
    name: "千喜鹤食堂",
    latitude: 29.532777777777778 - 0.0027,
    longitude: 106.605 + 0.0039,
    owner: "所属：一号线",
    nearby: "周边：千喜鹤食堂 延生食堂 樱花超市"
  },
  {
    name: "明理一",
    latitude: 29.53388888888889 - 0.00285,
    longitude: 106.60555555555555 + 0.0039,
    owner: "所属：一号线 二号线",
    nearby: "周边：学生服务中心 绿色书屋 明理苑1舍 知行苑8舍"
  },
  // {
  //   name: "兴业苑",
  //   latitude: 29.535555555555554 - 0.00285,
  //   longitude: 106.60777777777778 + 0.00365,
  //   owner: "所属：一号线",
  //   nearby: "周边：..."
  // },
  {
    name: "八教",
    latitude: 29.537777777777777 - 0.00285,
    longitude: 106.60694444444445 + 0.00385,
    owner: "所属：一号线",
    nearby: "周边：第八教学楼 传媒艺术学院"
  },
  // {
  //   name: "四／五教",
  //   latitude: 29.538611111111113 - 0.00275,
  //   longitude: 106.60638888888889 + 0.0037,
  //   owner: "所属：一号线",
  //   nearby: "周边：..."
  // },
  {
    name: "三教",
    latitude: 29.538055555555555 - 0.00275,
    longitude: 106.60444444444444 + 0.0037,
    owner: "所属：一号线",
    nearby: "周边：第三教学楼 风雨操场"
  },
  {
    name: "腾飞门",
    latitude: 29.538055555555555 - 0.00275,
    longitude: 106.60166666666667 + 0.0038,
    owner: "所属：一号线 二号线 三号线 四号线",
    nearby: "周边：行政楼 中心网球场"
  },
  {
    name: "二教",
    latitude: 29.535555555555554 - 0.0032,
    longitude: 106.60166666666667 + 0.0053,
    owner: "所属：一号线",
    nearby: "周边：第二教学楼 计算机学院 软件工程学院 老图书馆"
  },
  {
    name: "大西北食堂",
    latitude: 29.53361111111111 - 0.0028,
    longitude: 106.60388888888889 + 0.0039,
    owner: "所属：二号线",
    nearby: "周边：大西北食堂 宁静苑5舍"
  },
  {
    name: "逸夫楼",
    latitude: 29.538055555555555 - 0.002,
    longitude: 106.60444444444444 + 0.0037,
    owner: "所属：一号线 二号线 三号线",
    nearby: "周边：通信学院 逸夫楼 第四教学楼"
  },
  // {
  //   name: "留学生楼",
  //   latitude: 29.538055555555555 - 0.0036,
  //   longitude: 106.60444444444444 + 0.0054,
  //   owner: "所属：一号线",
  //   nearby: "周边："
  // },
  {
    name: "经管学院",
    latitude: 29.538055555555555 - 0.00372,
    longitude: 106.60444444444444 + 0.00629,
    owner: "所属：一号线 二号线",
    nearby: "周边：经管学院 现代邮政学院"
  },
  {
    name: "兴业苑6舍", //16
    latitude: 29.535555555555554 - 0.00285,
    longitude: 106.60777777777778 + 0.00365,
    owner: "所属：一号线 二号线",
    nearby: "周边：莘莘食堂 菜鸟驿站 兴业苑7舍"
  },
  {
    name: "物业管理中心", //17
    latitude: 29.53361111111111 - 0.0028,
    longitude: 106.60388888888889 + 0.0039,
    owner: "所属：一号线 二号线",
    nearby: "周边：千喜鹤食堂"
  },
  {
    name: "南部校区十字路口", //18
    latitude: 29.529166666666665 - 0.0024,
    longitude: 106.60194444444444 + 0.00505,
    owner: "所属：二号线 三号线",
    nearby: "周边：家属楼"
  },
  {
    name: "宁静苑8舍",
    latitude: 29.531944444444445 - 0.0034,
    longitude: 106.60305555555556 + 0.0039,
    owner: "所属：二号线",
    nearby: "周边：宁静苑1舍 宁静苑10舍"
  },
  {
    name: "樱花食堂",
    latitude: 29.532777777777778 - 0.00258,
    longitude: 106.605 + 0.00322,
    owner: "所属：二号线",
    nearby: "周边：樱花食堂 延生食堂 知行苑1舍"
  },
  {
    name: "荷花池",
    latitude: 29.535555555555554 - 0.0051,
    longitude: 106.60166666666667 + 0.0048,
    owner: "所属：二号线 三号线 四号线",
    nearby: "周边：老图书馆"
  },
  {
    name: "重邮信科楼",
    latitude: 29.535555555555554 - 0.0044,
    longitude: 106.60166666666667 + 0.00256,
    owner: "所属：二号线 三号线 四号线",
    nearby: "周边：重邮信科楼 重邮宾馆"
  },
  {
    name: "北校门路口",
    latitude: 29.538055555555555 - 0.0015,
    longitude: 106.60444444444444 + 0.0037,
    owner: "所属：二号线",
    nearby: "周边：北校门 逸夫楼 第四教学楼"
  },
  {
    name: "国际学院",
    latitude: 29.538611111111113 - 0.00275,
    longitude: 106.60638888888889 + 0.0037,
    owner: "所属：二号线",
    nearby: "周边：国际学院 外国语学院 第五教学楼"
  },
  {
    name: "后勤处",
    latitude: 29.531944444444445 - 0.00313,
    longitude: 106.60305555555556 + 0.0035,
    owner: "所属：三号线 四号线",
    nearby: "周边：宁静苑2舍 宁静苑3舍"
  },
  {
    name: "南部校区80栋",
    latitude: 29.529166666666665 - 0.0053,
    longitude: 106.60194444444444 + 0.0057,
    owner: "所属：四号线",
    nearby: "周边：家属楼"
  }
];

export const roads = {
  one: {
    bus: "一号",
    stations: [
      "崇文门",
      "腾飞门",
      "逸夫楼",
      "留学生楼",
      "经管学院",
      "兴业苑6舍",
      "明理苑1舍",
      "千喜鹤"
    ],
    time: "运行时间：7:00-22:00",
    num: `停靠站点数：8`,
    points: [
      {
        latitude: 29.535833333333333 - 0.003,
        longitude: 106.60055555555556 + 0.00407
      },
      {
        latitude: 29.535833333333333 - 0.0016,
        longitude: 106.60166666666667 + 0.0038
      },
      {
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60166666666667 + 0.0038
      },
      {
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        latitude: 29.538055555555555 - 0.00145,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        latitude: 29.538055555555555 - 0.00145,
        longitude: 106.60444444444444 + 0.005
      },
      {
        latitude: 29.538055555555555 - 0.00156,
        longitude: 106.60444444444444 + 0.0054
      },
      {
        latitude: 29.538055555555555 - 0.0016,
        longitude: 106.60444444444444 + 0.0055
      },
      {
        latitude: 29.538611111111113 - 0.00275,
        longitude: 106.60638888888889 + 0.0037
      },
      {
        latitude: 29.538611111111113 - 0.00275,
        longitude: 106.60638888888889 + 0.00435
      },
      {
        latitude: 29.537777777777777 - 0.00285,
        longitude: 106.60694444444445 + 0.00381
      },
      {
        latitude: 29.538055555555555 - 0.00372,
        longitude: 106.60444444444444 + 0.00629
      },
      {
        name: "八教2",
        latitude: 29.537777777777777 - 0.00365,
        longitude: 106.60694444444445 + 0.0038
      },
      {
        name: "八教3",
        latitude: 29.537777777777777 - 0.00385,
        longitude: 106.60694444444445 + 0.00395
      },
      {
        name: "八教4",
        latitude: 29.537777777777777 - 0.004,
        longitude: 106.60694444444445 + 0.0044
      },
      {
        name: "兴业苑",
        latitude: 29.535555555555554 - 0.00285,
        longitude: 106.60777777777778 + 0.0036
      },
      {
        name: "兴业苑2",
        latitude: 29.535555555555554 - 0.0045,
        longitude: 106.60777777777778 + 0.0036
      },
      {
        name: "兴业苑3",
        latitude: 29.535555555555554 - 0.00452,
        longitude: 106.60777777777778 + 0.0015
      },
      {
        name: "明理1",
        latitude: 29.535555555555554 - 0.00452,
        longitude: 106.60777777777778 + 0.0015
      },
      {
        name: "明理12",
        latitude: 29.535555555555554 - 0.0047,
        longitude: 106.60777777777778 + 0.00122
      },
      {
        name: "千喜鹤",
        latitude: 29.532777777777778 - 0.0027,
        longitude: 106.605 + 0.00395
      }
      // ,
      // {
      //   name: "千喜鹤2",
      //   latitude: 29.532777777777778 - 0.0032,
      //   longitude: 106.605 + 0.00391
      // },
      // {
      //   name: "千喜鹤3",
      //   latitude: 29.532777777777778 - 0.0032,
      //   longitude: 106.605 + 0.00352
      // },
      // {
      //   name: "千喜鹤4",
      //   latitude: 29.532777777777778 - 0.0035,
      //   longitude: 106.605 + 0.0034
      // }
    ]
  },
  two: {
    bus: "二号",
    stations: [
      "综合实验楼",
      "南部校区十字路口",
      "宁静苑8舍",
      "荷花池",
      "重邮信科楼",
      "崇文门",
      "腾飞门",
      "逸夫楼",
      "北校门路口",
      "国际学院",
      "经管学院",
      "兴业苑6舍",
      "明理苑1舍路口",
      "千喜鹤",
      "樱花食堂",
      "大西北食堂"
    ],
    time: "运行时间：7:00-22:00",
    num: `停靠站点数：15`,
    points: [
      {
        latitude: 29.529166666666665 - 0.003,
        longitude: 106.60194444444444 + 0.00375
      },
      {
        name: "综合实验楼1",
        latitude: 29.529166666666665 - 0.00242,
        longitude: 106.60194444444444 + 0.00371
      },
      {
        latitude: 29.529166666666665 - 0.0024,
        longitude: 106.60194444444444 + 0.00504
      },
      {
        name: "宁静苑8舍",
        latitude: 29.531944444444445 - 0.0034,
        longitude: 106.60305555555556 + 0.00387
      },
      {
        latitude: 29.531944444444445 - 0.00135,
        longitude: 106.60305555555556 + 0.00389
      },
      {
        name: "荷花池",
        latitude: 29.535555555555554 - 0.0051,
        longitude: 106.60166666666667 + 0.0048
      },
      {
        latitude: 29.535555555555554 - 0.00515,
        longitude: 106.60166666666667 + 0.00458
      },
      {
        latitude: 29.535555555555554 - 0.00542,
        longitude: 106.60166666666667 + 0.00458
      },
      {
        latitude: 29.535555555555554 - 0.00542,
        longitude: 106.60166666666667 + 0.00255
      },
      {
        name: "重邮信科楼",
        latitude: 29.535555555555554 - 0.0044,
        longitude: 106.60166666666667 + 0.00256
      },
      {
        latitude: 29.535555555555554 - 0.004,
        longitude: 106.60166666666667 + 0.002572
      },
      {
        latitude: 29.535555555555554 - 0.0037,
        longitude: 106.60166666666667 + 0.00265
      },
      {
        name: "崇文门",
        latitude: 29.535833333333333 - 0.003,
        longitude: 106.60055555555556 + 0.00415
      },
      {
        latitude: 29.535833333333333 - 0.00163,
        longitude: 106.60055555555556 + 0.00492
      },
      {
        name: "腾飞门",
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60166666666667 + 0.0038
      },
      {
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60166666666667 + 0.0038
      },
      {
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        latitude: 29.538055555555555 - 0.00145,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        latitude: 29.538055555555555 - 0.00145,
        longitude: 106.60444444444444 + 0.005
      },
      {
        latitude: 29.538055555555555 - 0.00156,
        longitude: 106.60444444444444 + 0.0054
      },
      {
        latitude: 29.538055555555555 - 0.0016,
        longitude: 106.60444444444444 + 0.0055
      },
      {
        latitude: 29.538611111111113 - 0.00275,
        longitude: 106.60638888888889 + 0.0037
      },
      {
        latitude: 29.538611111111113 - 0.00275,
        longitude: 106.60638888888889 + 0.00435
      },
      {
        latitude: 29.537777777777777 - 0.00285,
        longitude: 106.60694444444445 + 0.00381
      },
      {
        latitude: 29.538055555555555 - 0.00372,
        longitude: 106.60444444444444 + 0.00629
      },
      {
        name: "八教2",
        latitude: 29.537777777777777 - 0.00365,
        longitude: 106.60694444444445 + 0.0038
      },
      {
        name: "八教3",
        latitude: 29.537777777777777 - 0.00385,
        longitude: 106.60694444444445 + 0.00395
      },
      {
        name: "八教4",
        latitude: 29.537777777777777 - 0.004,
        longitude: 106.60694444444445 + 0.0044
      },
      {
        name: "兴业苑",
        latitude: 29.535555555555554 - 0.00285,
        longitude: 106.60777777777778 + 0.0036
      },
      {
        name: "兴业苑2",
        latitude: 29.535555555555554 - 0.0045,
        longitude: 106.60777777777778 + 0.0036
      },
      {
        name: "兴业苑3",
        latitude: 29.535555555555554 - 0.00452,
        longitude: 106.60777777777778 + 0.0015
      },
      {
        name: "明理1",
        latitude: 29.535555555555554 - 0.00452,
        longitude: 106.60777777777778 + 0.0015
      },
      {
        name: "明理12",
        latitude: 29.535555555555554 - 0.0047,
        longitude: 106.60777777777778 + 0.00122
      },
      {
        name: "千喜鹤",
        latitude: 29.532777777777778 - 0.0027,
        longitude: 106.605 + 0.00395
      },
      {
        name: "千喜鹤2",
        latitude: 29.532777777777778 - 0.0032,
        longitude: 106.605 + 0.00391
      },
      {
        name: "千喜鹤3",
        latitude: 29.532777777777778 - 0.0032,
        longitude: 106.605 + 0.00352
      },
      {
        latitude: 29.532777777777778 - 0.0035,
        longitude: 106.605 + 0.0034
      },
      {
        latitude: 29.532777777777778 - 0.0035,
        longitude: 106.605 + 0.00313
      },
      {
        latitude: 29.532777777777778 - 0.00258,
        longitude: 106.605 + 0.00322
      },
      {
        latitude: 29.531944444444445 - 0.00143,
        longitude: 106.60305555555556 + 0.00516
      },
      {
        latitude: 29.53361111111111 - 0.00305,
        longitude: 106.60388888888889 + 0.00418
      },
      {
        latitude: 29.53361111111111 - 0.0028,
        longitude: 106.60388888888889 + 0.0042
      },
      {
        //大西北
        latitude: 29.53361111111111 - 0.00284,
        longitude: 106.60388888888889 + 0.0039
      }
    ]
  },
  three: {
    bus: "三号",
    stations: [
      "八教",
      "四教/五教",
      "逸夫楼",
      "三教",
      "二教",
      "宁静苑8舍",
      "南部校区十字路口",
      "综合实验楼"
    ],
    time: "运行时间：7:00-22:00",
    num: `停靠站点数：8`,
    points: [
      {
        name: "综合实验楼",
        latitude: 29.529166666666665 - 0.003,
        longitude: 106.60194444444444 + 0.00375
      },
      {
        name: "综合实验楼1",
        latitude: 29.529166666666665 - 0.00242,
        longitude: 106.60194444444444 + 0.00371
      },
      {
        name: "综合实验楼2",
        latitude: 29.529166666666665 - 0.0024,
        longitude: 106.60194444444444 + 0.00502
      },
      {
        name: "宁静苑",
        latitude: 29.531944444444445 - 0.0028,
        longitude: 106.60305555555556 + 0.0039
      },
      {
        name: "二教",
        latitude: 29.535555555555554 - 0.0032,
        longitude: 106.60166666666667 + 0.0053
      },
      {
        name: "二教1",
        latitude: 29.535555555555554 - 0.00165,
        longitude: 106.60166666666667 + 0.00529
      },
      {
        name: "二教2",
        latitude: 29.535555555555554 - 0.0013,
        longitude: 106.60166666666667 + 0.00506
      },
      {
        name: "二教3",
        latitude: 29.535555555555554 - 0.0011,
        longitude: 106.60166666666667 + 0.00513
      },
      {
        name: "二教4",
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60166666666667 + 0.0052
      },
      {
        name: "三教",
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        name: "三教1",
        latitude: 29.538055555555555 - 0.00144,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        name: "三教1",
        latitude: 29.538055555555555 - 0.00144,
        longitude: 106.60444444444444 + 0.0037
      },
      {
        name: "三教2",
        latitude: 29.538055555555555 - 0.00145,
        longitude: 106.60444444444444 + 0.0052
      },
      {
        name: "三教3",
        latitude: 29.538055555555555 - 0.0016,
        longitude: 106.60444444444444 + 0.00548
      },
      {
        name: "四教",
        latitude: 29.538055555555555 - 0.00218,
        longitude: 106.60444444444444 + 0.00565
      },
      {
        name: "四教1",
        latitude: 29.538055555555555 - 0.0022,
        longitude: 106.60444444444444 + 0.00625
      },
      {
        name: "四教2",
        latitude: 29.538055555555555 - 0.0023,
        longitude: 106.60444444444444 + 0.0063
      },
      {
        name: "八教",
        latitude: 29.537777777777777 - 0.00285,
        longitude: 106.60694444444445 + 0.0038
      }
    ]
  },
  four: {
    bus: "四号",
    stations: [
      "南部校区80栋",
      "后勤处路口",
      "荷花池",
      "重邮信科楼",
      "崇文门",
      "腾飞门"
    ],
    time: "运行时间：7:00-22:00",
    num: `停靠站点数：6`,
    points: [
      {
        name: "南部校区80栋",
        latitude: 29.529166666666665 - 0.0053,
        longitude: 106.60194444444444 + 0.0057
      },
      {
        latitude: 29.529166666666665 - 0.0051,
        longitude: 106.60194444444444 + 0.0057
      },
      {
        latitude: 29.529166666666665 - 0.005,
        longitude: 106.60194444444444 + 0.0055
      },
      {
        latitude: 29.529166666666665 - 0.0033,
        longitude: 106.60194444444444 + 0.00545
      },
      {
        latitude: 29.529166666666665 - 0.00325,
        longitude: 106.60194444444444 + 0.0053
      },
      {
        latitude: 29.529166666666665 - 0.0029,
        longitude: 106.60194444444444 + 0.0053
      },
      {
        latitude: 29.529166666666665 - 0.0029,
        longitude: 106.60194444444444 + 0.0055
      },
      {
        latitude: 29.529166666666665 - 0.0024,
        longitude: 106.60194444444444 + 0.0055
      },
      {
        name: "南部校区十字路口", //18
        latitude: 29.529166666666665 - 0.0024,
        longitude: 106.60194444444444 + 0.00505
      },
      {
        name: "宁静苑8舍",
        latitude: 29.531944444444445 - 0.0034,
        longitude: 106.60305555555556 + 0.0039
      },
      {
        latitude: 29.531944444444445 - 0.00135,
        longitude: 106.60305555555556 + 0.00389
      },
      {
        name: "荷花池",
        latitude: 29.535555555555554 - 0.0051,
        longitude: 106.60166666666667 + 0.0048
      },
      {
        latitude: 29.535555555555554 - 0.00515,
        longitude: 106.60166666666667 + 0.00458
      },
      {
        latitude: 29.535555555555554 - 0.00542,
        longitude: 106.60166666666667 + 0.00458
      },
      {
        latitude: 29.535555555555554 - 0.00542,
        longitude: 106.60166666666667 + 0.00255
      },
      {
        name: "重邮信科楼",
        latitude: 29.535555555555554 - 0.0044,
        longitude: 106.60166666666667 + 0.00256
      },
      {
        latitude: 29.535555555555554 - 0.004,
        longitude: 106.60166666666667 + 0.002572
      },
      {
        latitude: 29.535555555555554 - 0.0037,
        longitude: 106.60166666666667 + 0.00265
      },
      {
        name: "崇文门",
        latitude: 29.535833333333333 - 0.003,
        longitude: 106.60055555555556 + 0.00415
      },
      {
        latitude: 29.535833333333333 - 0.00163,
        longitude: 106.60055555555556 + 0.00492
      },
      {
        name: "腾飞门",
        latitude: 29.538055555555555 - 0.00275,
        longitude: 106.60166666666667 + 0.0038
      }
    ]
  }
};

export const pureRoads = [
  {
    name: "一号",
    color: "#9748f9",
    time: "运行时间：7:00-22:00",
    station: [
      "崇文门",
      "腾飞门",
      "逸夫楼",
      "留学生楼",
      "经管学院",
      "兴业苑6舍",
      "明理苑1舍",
      "千喜鹤"
    ]
  },
  {
    name: "二号",
    color: "#16ad5e",
    time: "运行时间：7:00-22:00",
    station: [
      "综合实验楼",
      "南部校区十字路口",
      "宁静苑8舍",
      "荷花池",
      "重邮信科楼",
      "崇文门",
      "腾飞门",
      "逸夫楼",
      "北校门路口",
      "国际学院",
      "经管学院",
      "兴业苑6舍",
      "明理苑1舍路口",
      "千喜鹤",
      "樱花食堂",
      "大西北食堂"
    ]
  },
  {
    name: "三号",
    color: "#1099f9",
    time: "运行时间：7:00-22:00",
    station: [
      "八教",
      "四教/五教",
      "逸夫楼",
      "三教",
      "二教",
      "宁静苑8舍",
      "南部校区十字路口",
      "综合实验楼"
    ]
  },
  {
    name: "四号",
    color: "#fbce2d",
    time: "运行时间：7:00-22:00",
    station: [
      "南部校区80栋",
      "后勤处路口",
      "荷花池",
      "重邮信科楼",
      "崇文门",
      "腾飞门"
    ]
  }
];
